//
// This file contains an 'Intel Peripheral Driver' and is
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may
// be modified by the user, subject to additional terms of the
// license agreement
//
// *++
//
// Copyright (c) 1999 - 2016 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//
//
// Module Name:
//
//   MemoryDfxSetupStrings.uni
//
// Abstract:
//
//   String definitions for Memory Dfx Setup formset.
//
// Revision History:
//
// --*/

/=#

#langdef   en-US "English"

#string STR_MEMORY_DFX_CONFIG_FORM_TITLE                   #language en-US "Memory Dfx Configuration"
#string STR_MEMORY_DFX_CONFIG_FORM_HELP                    #language en-US "Displays and provides option to change the Memory Dfx Settings"

#string STR_PARTITION_DDRT_PROMPT   #language en-US "NVMDIMM Partitioning"
#string STR_PARTITION_DDRT_HELP   #language en-US "Enable NVMDIMM partitioning."

#string STR_S0MC0_PARTITION_RATIO_PROMPT   #language en-US "S0 MC0 Partition Ratio"
#string STR_S0MC0_PARTITION_RATIO_HELP   #language en-US "Partition ratios of VOL, PMEM and BLK region for NVMDIMMs in Socket0 MC0"
#string STR_S0MC1_PARTITION_RATIO_PROMPT   #language en-US "S0 MC1 Partition Ratio"
#string STR_S0MC1_PARTITION_RATIO_HELP   #language en-US "Partition ratios of VOL, PMEM and BLK region for NVMDIMMs in Socket0 MC1"
#string STR_S1MC0_PARTITION_RATIO_PROMPT   #language en-US "S1 MC0 Partition Ratio"
#string STR_S1MC0_PARTITION_RATIO_HELP   #language en-US "Partition ratios of VOL, PMEM and BLK region for NVMDIMMs in Socket1 MC0"
#string STR_S1MC1_PARTITION_RATIO_PROMPT   #language en-US "S1 MC1 Partition Ratio"
#string STR_S1MC1_PARTITION_RATIO_HELP   #language en-US "Partition ratios of VOL, PMEM and BLK region for NVMDIMMs in Socket1 MC1"
#string STR_S2MC0_PARTITION_RATIO_PROMPT   #language en-US "S2 MC0 Partition Ratio"
#string STR_S2MC0_PARTITION_RATIO_HELP   #language en-US "Partition ratios of VOL, PMEM and BLK region for NVMDIMMs in Socket2 MC0"
#string STR_S2MC1_PARTITION_RATIO_PROMPT   #language en-US "S2 MC1 Partition Ratio"
#string STR_S2MC1_PARTITION_RATIO_HELP   #language en-US "Partition ratios of VOL, PMEM and BLK region for NVMDIMMs in Socket2 MC1"
#string STR_S3MC0_PARTITION_RATIO_PROMPT   #language en-US "S3 MC0 Partition Ratio"
#string STR_S3MC0_PARTITION_RATIO_HELP   #language en-US "Partition ratios of VOL, PMEM and BLK region for NVMDIMMs in Socket3 MC0"
#string STR_S3MC1_PARTITION_RATIO_PROMPT   #language en-US "S3 MC1 Partition Ratio"
#string STR_S3MC1_PARTITION_RATIO_HELP   #language en-US "Partition ratios of VOL, PMEM and BLK region for NVMDIMMs in Socket3 MC1"

#string STR_RATIO_20_80_0   #language en-US "VOL:20% PMEM:80% BLK:0%"
#string STR_RATIO_80_20_0   #language en-US "VOL:80% PMEM:20% BLK:0%"
#string STR_RATIO_50_50_0   #language en-US "VOL:50% PMEM:50% BLK:0%"
#string STR_RATIO_60_0_40   #language en-US "VOL:60% PMEM:0% BLK:40%"
#string STR_RATIO_40_10_50   #language en-US "VOL:40% PMEM:10% BLK:50%"
#string STR_RATIO_0_40_60   #language en-US "VOL:0% PMEM:40% BLK:60%"
#string STR_RATIO_0_30_70   #language en-US "VOL:0% PMEM:30% BLK:70%"
#string STR_RATIO_100_0_0   #language en-US "VOL:100% PMEM:0% BLK:0%"
#string STR_RATIO_0_100_0   #language en-US "VOL:0% PMEM:100% BLK:0%"
#string STR_RATIO_0_0_100   #language en-US "VOL:0% PMEM:0% BLK:100%"
#string STR_RATIO_30_60_10   #language en-US "VOL:30% PMEM:60% BLK:10%"
#string STR_RATIO_70_0_30   #language en-US "VOL:70% PMEM:0% BLK:30%"


#string STR_DIMM_MGMT_PROMPT   #language en-US "DIMM Management"
#string STR_DIMM_MGMT_HELP     #language en-US "Selects whether BIOS Setup or the NGN DIMM Management Driver will control the NVMDIMMs."
#string STR_BIOS_SETUP         #language en-US "BIOS Setup"
#string STR_CR_MGMT_DRIVER     #language en-US "NGN DIMM Management Driver"

#string STR_LOAD_DIMM_MGMT_DRV_PROMPT   #language en-US "Load NGN DIMM Management Drivers"
#string STR_LOAD_DIMM_MGMT_DRV_HELP     #language en-US "Enable/Disable to load the NGN DIMM Management Drivers for NVMDIMMs(install the gNfitBindingProtocolGuid)."

#string STR_PEM_MEM_MODE                    #language en-US "Persistent Memory Mode"
#string STR_PER_MEM_MODE_HELP          #language en-US "Selects whether Persistent memory mode should be enabled."

#string STR_CFG_MASK_2LM                    #language en-US "Configuration Mask for 2LM"
#string STR_CFG_MASK_2LM_HELP               #language en-US "Selects the mask type to use for 2LM configurations"
#string STR_NORMAL                          #language en-US "Normal"
#string STR_AGGRESSIVE                      #language en-US "Aggressive"

#string STR_ECC_SUPPORT_PROMPT              #language en-US "ECC Support"
#string STR_ECC_SUPPORT_HELP                #language en-US "Enable - Enables DDR ECC Support. Disable - Disables this feature. Auto - Sets it to MRC default setting; current default is Enable."

#string STR_CR_MIXED_SKU_PROMPT              #language en-US "CR Halt/Warn Mixed SKU"
#string STR_CR_MIXED_SKU_HELP                #language en-US "Enable will raise Fatal error and halt the system; Disable will log warning and continue booting to shell/OS"

#string STR_INTERLEAVING_PROMPT             #language en-US "Memory Interleaving"
#string STR_INTERLEAVING_HELP               #language en-US "Maximum Node Interleave (1,2,4-way)"
#string STR_1WAY                            #language en-US "NUMA (1-way) Node Interleave"           
#string STR_2WAY                            #language en-US "2-way Node Interleave"           
#string STR_4WAY                            #language en-US "4-way Node Interleave"           

#string STR_MEMMAP_LOWMEMCHANNEL_PROMPT     #language en-US "Low Mem Channel Config"
#string STR_MEMMAP_LOWMEMCHANNEL_HELP       #language en-US "Select Channel for low memory, Auto - 0 (BIOS select)"
                                                      
#string STR_MEMMAP_LOWMEMCHANNEL_0_STRING   #language en-US "Channel 0"
#string STR_MEMMAP_LOWMEMCHANNEL_1_STRING   #language en-US "Channel 1"
#string STR_MEMMAP_LOWMEMCHANNEL_2_STRING   #language en-US "Channel 2"
#string STR_MEMMAP_LOWMEMCHANNEL_3_STRING   #language en-US "Channel 3"

#string STR_MEMMAP_HIGHADDRBIT_PROMPT       #language en-US "High Address Region"
#string STR_MEMMAP_HIGHADDRBIT_HELP         #language en-US "High Address Region starting bit position. Auto - 0 (not enabled). Note that the actual start of the region is 2**N - 64MB, where N is the selected bit position."

#string STR_MEMMAP_HIGHADDRBIT_33_STRING    #language en-US "Bit Position 33"
#string STR_MEMMAP_HIGHADDRBIT_34_STRING    #language en-US "Bit Position 34"
#string STR_MEMMAP_HIGHADDRBIT_35_STRING    #language en-US "Bit Position 35"
#string STR_MEMMAP_HIGHADDRBIT_36_STRING    #language en-US "Bit Position 36"
#string STR_MEMMAP_HIGHADDRBIT_37_STRING    #language en-US "Bit Position 37"
#string STR_MEMMAP_HIGHADDRBIT_38_STRING    #language en-US "Bit Position 38"
#string STR_MEMMAP_HIGHADDRBIT_39_STRING    #language en-US "Bit Position 39"
#string STR_MEMMAP_HIGHADDRBIT_40_STRING    #language en-US "Bit Position 40"
#string STR_MEMMAP_HIGHADDRBIT_41_STRING    #language en-US "Bit Position 41"
#string STR_MEMMAP_HIGHADDRBIT_42_STRING    #language en-US "Bit Position 42"
#string STR_MEMMAP_HIGHADDRBIT_43_STRING    #language en-US "Bit Position 43"
#string STR_MEMMAP_HIGHADDRBIT_44_STRING    #language en-US "Bit Position 44"
#string STR_MEMMAP_HIGHADDRBIT_45_STRING    #language en-US "Bit Position 45"

//
// End of file
//

